/*
* 隐私政策提示文本
*/
// @dart=2.9
import 'package:dong_gan_dan_che/common/BaseUtil.dart';
import 'package:flutter/material.dart';
import 'package:font_awesome_flutter/font_awesome_flutter.dart';

class PrivacyPage extends StatelessWidget {

  @override
  Widget build(BuildContext context) {
    var str = "本政策仅适用于{公司名}的{产品名}产品或服务。 最近更新日期：{隐私政策更新时间}\n"+
            "本政策将帮助您了解以下内容：\n"+
            "一、我们如何收集和使用您的用户信息\n"+
            "二、我们如何使用 Cookie 和同类技术\n"+
            "三、我们如何共享、转让、公开披露您的用户信息\n"+
            "四、我们如何保护您的用户信息\n"+
            "五、您的权利\n"+
            "六、我们如何处理儿童的个人信息\n"+
            "七、您的用户信息如何储存及如何在全球范围转移\n"+
            "八、本政策如何更新\n"+
            "九、如何联系我们\n"+
            "\n"+
            "我们深知用户信息对您的重要性，并会尽全力保护您的用户信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的用户信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时，我们承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的用户信息。\n"+
            "请在使用我们的产品（或服务）前，仔细阅读并了解本隐私政策。\n"+
            "\n"+
            "一、我们如何收集和使用您的用户信息\n"+
            "（一）您使用我司产品或服务过程中我们收集和使用的信息\n"+
            "我们仅会出于本政策所述的业务功能，收集和使用您的用户信息，收集用户信息的目的在于向您提供产品或服务，您有权自行选择是否提供该信息，但多数情况下，如果您不提供，我们可能无法向您提供相应的服务，也无法回应您遇到的问题：\n"+
            "在您使用我们的服务时，允许我们收集您自行向我们提供的或为向您提供服务所必要的信息包括：个人身份信息、设备信息、日志信息、IP地址、位置信息等。\n"+
            "对于我们收集的用户信息，我们将用于为您提供身份验证、客户服务、安全防范、展示活动与体能训练记录等功能。\n"+
            "您提供的上述信息，将在您使用本服务期间持续授权我们使用。在您停止使用推送服务时，我们将停止使用并删除上述信息。\n"+
            "我们保证会依法对收集后的用户信息进行去标识化或匿名化处理，对于无法单独或者与其他信息结合识别自然人个人身份的信息，不属于法律意义上的个人信息。如果我们将非个人信息与其他信息结合识别到您的个人身份时，或者与您的个人信息结合使用时，我们会在结合使用期间，将此类信息作为您的个人信息按照本隐私政策对其进行处理和保护。\n"+
            "为了更好运营和改善我们的技术和服务，或出于商业策略的变化，当我们提供的产品或服务所需的用户信息收集、使用、处理超出上述范围或者要将收集到的用户信息用于本隐私政策未载明的其他用途，或当我们要将基于特定目的收集而来的信息用于其他目的时，我们会在获取用户信息后的合理期限内或处理用户信息前通知您，并获得您的授权同意。\n"+
            "\n"+
            "（二）征得授权同意的例外\n"+
            "请您理解，根据法律法规及相关国家标准，以下情形中，我们收集和使用您的用户信息无需征得您的授权同意： \n"+
            "1、与国家安全、国防安全直接相关的； \n"+
            "2、与公共安全、公共卫生、重大公共利益直接相关的； \n"+
            "3、与犯罪侦查、起诉、审判和判决执行等直接相关的； \n"+
            "4、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的； \n"+
            "5、所收集的您的用户信息是您自行向社会公众公开的；\n"+
            "6、从合法公开披露的信息中收集的您的用户信息，如合法的新闻报道、政府信息公开等渠道； \n"+
            "7、根据您的要求签订或履行合同所必需的； \n"+
            "8、用于维护软件及相关服务的安全稳定运行所必需的，例如发现、处置软件及相关服务的故障；\n"+
            "9、 个人信息控制者为新闻单位且其在开展合法的新闻报道所必需的； \n"+
            "10、学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的。\n"+
            "11、法律法规规定的其他情形。\n"+
            "\n"+
            "二、我们如何使用 Cookie 和同类技术\n"+
            "（一）Cookie\n"+
            "为确保网站正常运转，我们会在您的计算机或移动设备上存储名为 Cookie 的小数据文件。Cookie 通常包含标识符、站点名称以及一些号码和字符。借助于 Cookie，网站能够存储您的访问偏好数据。\n"+
            "我们不会将 Cookie 用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除 Cookie。您可以清除计算机上保存的所有 Cookie，大部分网络浏览器都设有阻止Cookie 的功能。但如果您这么做，则需要在每一次访问我们的网站时亲自更改用户设置。\n"+
            "\n"+
            "（二）网站信标和像素标签\n"+
            "除 Cookie 外，我们还会在网站上使用网站信标和像素标签等其他同类技术。例如，我们向您发送的电子邮件可能含有链接至我们网站内容的点击URL。\n"+
            "如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好并改善客户服务。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。\n"+
            "\n"+
            "（三）Do Not Track（请勿追踪）\n"+
            "很多网络浏览器均设有Do Not Track功能，该功能可向网站发布Do Not Track请求。目前，主要互联网标准组织尚未设立相关政策来规定网站应如何应对此类请求。但如果您的浏览器启用了 Do Not Track，那么我们的所有网站都会尊重您的选择。\n"+
            "\n"+
            "三、我们如何共享、转让、公开披露您的用户信息\n"+
            "（一）共享\n"+
            "我们不会与其他的任何公司、组织和个人分享您的用户信息，但以下情况除外：\n"+
            "1、在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的用户信息。\n"+
            "2、我们可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的用户信息。\n"+
            "3、与我们的关联公司共享：您的用户信息可能会与我们的关联公司共享。我们只会共享必要的用户信息，且受本隐私政策中所声明目的的约束。关联公司如要改变用户信息的处理目的，将再次征求您的授权同意。\n"+
            "4、与授权合作伙伴共享：仅为实现本政策中声明的目的，我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些用户信息，以提供更好的客户服务和用户体验。我们仅会出于合法、正当、必要、特定、明确的目的共享您的用户信息，并且只会共享提供服务所必要的用户信息。为了更好运营和改善技术和服务，您同意我们和授权合作伙伴在符合相关法律法规的前提下可将收集的信息用于其他服务和用途。\n"+
            "以下列举了具体的授权合作伙伴，并提供了该第三方的隐私政策链接，我们建议您阅读该第三方的隐私政策：\n"+
            "（1）消息推送服务供应商：由每日互动股份有限公司提供推送技术服务，我们可能会将您的设备平台、设备厂商及品牌、设备型号及系统版本、设备识别码、设备序列号等设备信息，应用列表信息、网络信息以及位置相关信息提供给每日互动股份有限公司，用于为您提供推送技术服务。我们在向您推送消息时，我们可能会授权每日互动股份有限公司进行链路调节，相互促活被关闭的SDK推送进程，保障您可以及时接收到我们向您推送的消息。详细内容请访问《个推用户隐私政策》。\n"+
            "（2）广告、媒体：我们可能会将收集到的信息共享给广告、媒体以及我们的其他授权合作伙伴，用于包括优化广告投放和提升营销效果等商业化用途。\n"+
            "{（3）XXX服务供应商：…………（按照自己集成第三方的服务添加，可以没有，也可以有（4）、（5），格式请参照（1）推送服务供应商）}。\n"+
            "对我们与之共享用户信息的公司、组织和个人，我们会与其签署严格的保密协定，要求他们按照我们的说明、本隐私政策以及其他任何相关的保密和安全措施来处理用户信息。\n"+
            "\n"+
            "（二）转让\n"+
            "我们不会将您的用户信息转让给任何公司、组织和个人，但以下情况除外：\n"+
            "1、在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的用户信息；\n"+
            "2、在涉及合并、收购或破产清算时，如涉及到用户信息转让，我们会再要求新的持有您用户信息的公司、组织继续受此隐私政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。\n"+
            "\n"+
            "（三）公开披露\n"+
            "我们仅会在以下情况下，公开披露您的用户信息：\n"+
            "1、获得您明确同意后；\n"+
            "2、基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的用户信息。\n"+
            "\n"+
            "（四）共享、转让、公开披露信息时事先征得授权同意的例外\n"+
            "请您理解，根据法律法规及相关国家标准，以下情形中，我们共享、转让、公开披露您的用户信息无需征得您的授权同意：\n"+
            "1、与国家安全、国防安全直接相关的； \n"+
            "2、与公共安全、公共卫生、重大公共利益直接相关的； \n"+
            "3、与犯罪侦查、起诉、审判和判决执行等直接相关的； \n"+
            "4、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的； \n"+
            "5、您自行向社会公众公开的信息； \n"+
            "6、从合法公开披露的信息中收集的，如合法的新闻报道、政府信息公开等渠道。\n"+
            "\n"+
            "四、我们如何保护您的用户信息\n"+
            "（一）我们已使用符合业界标准的安全防护措施保护您提供的用户信息，防止数据遭到未经授权的访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的用户信息。例如，在您的浏览器与“服务”之间交换数据时受 SSL 加密保护；我们同时对网站提供https安全浏览方式；我们会使用加密技术确保数据的保密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可访问用户信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护用户信息重要性的认识。\n"+
            "（二）我们已经取得了以下认证：{公司获取的相关认证内容}。\n"+
            "（三）我们的数据安全能力：{公司的数据安全能力描述}。\n"+
            "（四）我们会采取一切合理可行的措施，确保未收集无关的用户信息。我们只会在达成本政策所述目的所需的期限内保留您的用户信息，除非需要延长保留期或受到法律的允许。\n"+
            "（五）互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送用户信息。\n"+
            "（六）我们将定期更新并公开安全风险、用户信息安全影响评估等报告的有关内容。您可通过以下方式获得：补充安全风险公开途径\n"+
            "（七）互联网环境并非百分之百安全，我们将尽力确保您发送给我们的任何信息的安全性。即使我们做出了很大努力，采取了一切合理且必要的措施，仍然有可能无法杜绝您的用户信息被非法访问、被非法盗取，被非法篡改或毁坏，导致您的合法权益受损，请您理解信息网络的上述风险并自愿承担。\n"+
            "（八）在不幸发生用户信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知用户信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报用户信息安全事件的处置情况。\n"+
            "\n"+
            "五、您的权利\n"+
            "按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的用户信息行使以下权利：\n"+
            "（一）访问您的用户信息\n"+
            "您有权访问您的用户信息，法律法规规定的例外情况除外。如果您想行使数据访问权，可以通过以下方式自行访问：补充用户信息访问方式\n"+
            "如果您无法通过上述链接访问这些用户信息，您可以随时使用我们的 Web 表单联系，或发送电子邮件至{公司邮箱}。我们将在30天内回复您的访问请求。\n"+
            "对于您在使用我们的产品或服务过程中产生的其他用户信息，只要我们不需要过多投入，我们会向您提供。如果您想行使数据访问权，请发送电子邮件至{公司邮箱}。\n"+
            "\n"+
            "（二）更正您的用户信息\n"+
            "当您发现我们处理的关于您的用户信息有错误时，您有权要求我们作出更正。您可以通过“（一）访问您的用户信息”中罗列的方式提出更正申请。 如果您无法通过上述链接更正这些用户信息，您可以随时使用我们的 Web 表单联系，或发送电子邮件至{公司邮箱}。我们将在30天内回复您的更正请求。\n"+
            "\n"+
            "（三）删除您的用户信息\n"+
            "在以下情形中，您可以向我们提出删除用户信息的请求：\n"+
            "1、如果我们处理用户信息的行为违反法律法规；\n"+
            "2、如果我们收集、使用您的用户信息，却未征得您的同意；\n"+
            "3、如果我们处理用户信息的行为违反了与您的约定；\n"+
            "4、如果您不再使用我们的产品或服务，或您注销了账号；\n"+
            "5、如果我们不再为您提供产品或服务。\n"+
            "我们将会根据您的删除请求进行评估，若满足相应规定，我们将会采取相应步骤进行处理。当您向我们提出删除请求时，我们可能会要求您进行身份验证，以保障账户的安全。当您从我们的服务中删除信息后，因为适用的法律和安全技术，我们可能不会立即从备份系统中删除相应的信息，我们将安全存储您的信息直到备份可以清除或实现匿名化。\n"+
            "\n"+
            "（四）改变您授权同意的范围\n"+
            "每个业务功能需要一些基本的用户信息才能得以完成（见本政策“第一部分”）。对于用户信息的收集和使用，您可以随时给予或收回您的授权同意。您可以通过以下方式自行操作：补充改变用户信息的访问方式\n"+
            "当您收回同意后，我们将不再处理相应的用户信息。同时也请您注意，您撤销授权同意可能会导致某些后果，例如我们可能无法继续为您提供相应的服务或特定的功能，但您收回同意的决定，不会影响此前基于您的授权而开展的用户信息处理。\n"+
            "\n"+
            "（五）用户信息主体注销账户 \n"+
            "您随时可注销此前注册的账户，您可以通过以下方式自行操作：补充注销账户的操作方式\n"+
            "在注销账户之后，我们将停止为您提供产品或服务并依据您的要求，删除或匿名化您的信息，法律法规另有规定的除外。这也将可能导致您失去对您账户中数据的访问权，请您谨慎操作。\n"+
            "\n"+
            "（六）用户信息主体获取用户信息副本\n"+
            "您有权获取您的用户信息副本，您可以通过以下方式自行操作：补充获取用户信息副本的操作方式\n"+
            "在技术可行的前提下，例如数据接口匹配，我们还可按您的要求，直接将您的用户信息副本传输给您指定的第三方。\n"+
            "\n"+
            "（七）约束信息系统自动决策\n"+
            "在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制作出决定。如果这些决定显著影响您的合法权益，您有权要求我们作出解释，我们也将提供适当的救济方式。\n"+
            "\n"+
            "（八）响应您的上述请求\n"+
            "为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。";


    return Scaffold(
      resizeToAvoidBottomInset: false,
      body: Container(
        width: MediaQuery.of(context).size.width,
        height: MediaQuery.of(context).size.height,
        color: Colors.white,
        child: Column(
          children: [
            Container(
              color: Colors.white,
              padding: EdgeInsets.fromLTRB(BaseUtil.dp(16), BaseUtil.dp(30), BaseUtil.dp(16), BaseUtil.dp(10)),
              child: Row(
                children: [
                  GestureDetector(
                    behavior: HitTestBehavior.opaque,
                    onTap: () {
                      Navigator.pop(context);
                    },
                    child: Center(
                      child: Icon(
                        FontAwesomeIcons.angleLeft,
                        color: Color(0xFF333333),
                        size: BaseUtil.dp(20.0),
                      ),
                    ),
                  ),
                  Expanded(
                      flex: 1,
                      child: Center(
                        child: Text(
                          "隐私政策",
                          style: TextStyle(
                            color: Color(0xFF333333),
                            fontSize: BaseUtil.dp(16),
                          ),
                        ),
                      )
                  ),
                ],
              ),
            ),
            Padding(padding: EdgeInsets.only(top: BaseUtil.dp(5))),
            Expanded(
                flex: 1,
                child: SingleChildScrollView(
                  physics: const ClampingScrollPhysics(),
                  child: Container(
                    padding: EdgeInsets.symmetric(horizontal: BaseUtil.dp(16)),
                    child: Text(
                      str,
                      maxLines: 10000,
                    ),
                  ),
                )
            ),
            Padding(padding: EdgeInsets.only(top: BaseUtil.dp(10))),
          ],
        ),
      ),
    );
  }

}